stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Src/stm32u0xx_hal_flash_ex.c
  if ((rdplvl != OB_RDP_LEVEL_0) && (rdplvl != OB_RDP_LEVEL_2))
  {
    return (OB_RDP_LEVEL_1);
  }
  else
  {
    return rdplvl;
  }
}

/**
  * @brief  Return the FLASH User Option Byte value.
  * @retval The FLASH User Option Bytes values. It will be a combination of all the following values:
  *           @arg @ref FLASH_OB_USER_BOR_ENABLE
  *           @arg @ref FLASH_OB_USER_BOR_LEVEL
  *           @arg @ref FLASH_OB_USER_RESET_CONFIG
  *           @arg @ref FLASH_OB_USER_NRST_STOP
  *           @arg @ref FLASH_OB_USER_NRST_STANDBY
  *           @arg @ref FLASH_OB_USER_NRST_SHUTDOWN
  *           @arg @ref FLASH_OB_USER_IWDG_SW
  *           @arg @ref FLASH_OB_USER_IWDG_STOP
  *           @arg @ref FLASH_OB_USER_IWDG_STANDBY
  *           @arg @ref FLASH_OB_USER_WWDG_SW
  *           @arg @ref FLASH_OB_USER_SRAM_PARITY
  *           @arg @ref FLASH_OB_USER_NBOOT_SEL
  *           @arg @ref FLASH_OB_USER_NBOOT1
  *           @arg @ref FLASH_OB_USER_NBOOT0
  *           @arg @ref FLASH_OB_USER_INPUT_RESET_HOLDER
  */
static uint32_t FLASH_OB_GetUser(void)
{
  uint32_t user = ((FLASH->OPTR & ~FLASH_OPTR_RDP) & OB_USER_ALL);
  return user;
}

/**
  * @brief  Configure the HDP memory register.
  * @param   BootEntry  specifies if boot scheme is forced to Flash (System or user) or not
  *          This parameter can be one of the following values:
  *           @arg @ref OB_BOOT_LOCK_DISABLE No boot entry
  *           @arg @ref OB_BOOT_LOCK_ENABLE Flash selected as unique entry boot
  * @param   HDPEndPage specifies the end page of the hide protection area
  * @param   HDPEn     Enable and disable the HDP area
  * @retval None
  */
static void FLASH_OB_HDPConfig(uint32_t BootEntry, uint32_t HDPEndPage, uint32_t HDPEn)
{
  uint32_t secmem;

  /* Check the parameters */
  assert_param(IS_OB_BOOT_LOCK(BootEntry));
  assert_param(IS_FLASH_PAGE(HDPEndPage));
  /* Set securable memory area configuration */
  secmem = (FLASH->SECR & ~(FLASH_SECR_BOOT_LOCK | FLASH_SECR_HDP1_PEND | FLASH_SECR_HDP1EN));
  FLASH->SECR = (secmem | BootEntry | HDPEndPage | (HDPEn << FLASH_SECR_HDP1EN_Pos));
}

/**
  * @brief   Return the HDP memory register configuration.
  * @param   BootEntry  specifies if boot scheme configuration.
  * @param   HDPEndPage specifies the end page of the hide protection area
  * @param   HDPEn      specifies the status of the hide protection area (Enabled(other) or disabled(0xB4))
  * @retval None
  */
static void FLASH_OB_GetHDPConfig(uint32_t *BootEntry, uint32_t *HDPEndPage, uint32_t *HDPEn)
{
  uint32_t secmem = FLASH->SECR;

  *BootEntry = (secmem & FLASH_SECR_BOOT_LOCK);
  *HDPEndPage = (secmem & FLASH_SECR_HDP1_PEND);
  *HDPEn = (secmem & FLASH_SECR_HDP1EN) >> FLASH_SECR_HDP1EN_Pos;
}

/**
  * @brief  Set the read protection key.
  * @param  RDPKeyType specifies the read protection key type.
  *         This parameter can be one of the following values:
  *            @arg OB_RDP_KEY_OEM1: OEM1 key
  *            @arg OB_RDP_KEY_OEM2: OEM2 key
  * @param  RDPKey0 specifies the RDP key 0.
  * @param  RDPKey1 specifies the RDP key 1.
  * @param  RDPKey2 specifies the RDP key 2.
  * @param  RDPKey3 specifies the RDP key 3.
  * @retval None
  */
static void FLASH_OB_RDPKeyConfig(uint32_t RDPKeyType, uint32_t RDPKey0, uint32_t RDPKey1,
                                  uint32_t RDPKey2, uint32_t RDPKey3)
{
  /* Check the parameters */
  assert_param(IS_OB_RDP_KEY_TYPE(RDPKeyType));

  /* Configure the RDP OEM1/2 key */
  if (RDPKeyType == OB_RDP_KEY_OEM1)
  {
    WRITE_REG(FLASH->OEM1KEYW0R, RDPKey0);
    WRITE_REG(FLASH->OEM1KEYW1R, RDPKey1);
    WRITE_REG(FLASH->OEM1KEYW2R, RDPKey2);
    WRITE_REG(FLASH->OEM1KEYW3R, RDPKey3);
  }
  else if (RDPKeyType == OB_RDP_KEY_OEM2)
  {

    WRITE_REG(FLASH->OEM2KEYW0R, RDPKey0);
    WRITE_REG(FLASH->OEM2KEYW1R, RDPKey1);
    WRITE_REG(FLASH->OEM2KEYW2R, RDPKey2);
    WRITE_REG(FLASH->OEM2KEYW3R, RDPKey3);
  }
  else
  {
    /* nothing to do */
  }
}

/**
  * @brief  Get the OEM1/2 keys CRC.
  * @param  RDPKeyType specifies the read protection key type.
  *         This parameter can be one of the following values:
  *            @arg OB_RDP_KEY_OEM1: OEM1 key
  *            @arg OB_RDP_KEY_OEM2: OEM2 key
  * @param  OEMKeyCRC specifies the OEM keys CRC.
  * @retval None
  */
void HAL_FLASH_OB_GetOEMKeyCRC(uint32_t RDPKeyType, uint32_t *OEMKeyCRC)
{
  uint32_t regvalue;

  regvalue = FLASH->OEMKEYSR;
  if (RDPKeyType == OB_RDP_KEY_OEM1)
  {
    *OEMKeyCRC = (regvalue & FLASH_OEMKEYSR_OEM1KEYCRC);
  }
  else if (RDPKeyType == OB_RDP_KEY_OEM2)
  {
    *OEMKeyCRC = (regvalue & FLASH_OEMKEYSR_OEM2KEYCRC) >> FLASH_OEMKEYSR_OEM2KEYCRC_Pos;
  }
  else
  {
    /* Empty statement (to be compliant MISRA 15.7) */
  }
}

/**
  * @brief  Enable the HDP Protection area .
  * @param  Banks specifies the bank number
  *         this parameter can be:
  *         @arg @ref FLASH_BANK_1
  * @retval None
  */
void HAL_FLASHEx_EnableHDPProtection(uint32_t Banks)
{
  assert_param(IS_FLASH_BANK(Banks));

  MODIFY_REG(FLASH->HDPCR, FLASH_HDPCR_HDP1_ACCDIS, FLASH_HDPCR_HDP1_ACCDIS);
}

/**
  * @brief  Check if the HDP area protection enabled.
  * @retval returns 1 if the Protection is enabled
  *                 0 if the protection is disabled
  */
uint32_t HAL_FLASHEx_IsEnabledHDPProtection(void)
{
  return ((READ_BIT(FLASH->HDPCR, FLASH_HDPCR_HDP1_ACCDIS) == FLASH_HDPCR_HDP1_ACCDIS) ? 0UL : 1UL);
}
/**
  * @brief  HDP extension area configuration.
  * @param  pHDPExtension pointer to an FLASH_HDPExtentionTypeDef structure that
  *                       contains the configuration information.
  * @retval None
  */
void HAL_FLASHEx_ConfigHDPExtension(const FLASH_HDPExtensionTypeDef *pHDPExtension)
{
  assert_param(IS_FLASH_PAGE(pHDPExtension->NbPages));
  assert_param(IS_OB_HDPEXT_CONFIG(pHDPExtension->Status));

  MODIFY_REG(FLASH->HDPEXTR, FLASH_HDPEXTR_HDP1_EXT, (pHDPExtension->NbPages));
  MODIFY_REG(FLASH->HDPCR, FLASH_HDPCR_HDP1EXT_ACCDIS, (pHDPExtension->Status));
}
/**
  * @brief  Get HDP extension configuration.
  * @param  pHDPExtension pointer to an FLASH_HDPExtentionTypeDef structure that
  *                       contains the configuration information.
  * @retval None
  */
void HAL_FLASHEx_GetHDPExtensionConfig(FLASH_HDPExtensionTypeDef *pHDPExtension)
{
  uint32_t regvalue;

  regvalue = FLASH->HDPEXTR;
  pHDPExtension->NbPages = regvalue & FLASH_HDPEXTR_HDP1_EXT;
  regvalue = FLASH->HDPCR;
  pHDPExtension->Status = regvalue & FLASH_HDPCR_HDP1EXT_ACCDIS;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_FLASH_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
